In [2]:
import numpy as np
import pandas as pd

In [3]:
df1 = pd.DataFrame({"name": ["Bob","Harley","Nolan","Noah"],
                    "emp_id" : [101,102,103,104]
                  })

In [4]:
df2 = pd.DataFrame({"emp_id" : [101,103,105],
                    "salary" : [20000,40000,50000]
})

In [6]:
pd.merge(df1,df2, on = "emp_id", how = "inner")

    name  emp_id  salary
0    Bob     101   20000
1  Nolan     103   40000

In [7]:
pd.merge(df1,df2, on = "emp_id", how = "left")

     name  emp_id   salary
0     Bob     101  20000.0
1  Harley     102      NaN
2   Nolan     103  40000.0
3    Noah     104      NaN

In [8]:
pd.merge(df1,df2, on = "emp_id", how = "right")

    name  emp_id  salary
0    Bob     101   20000
1  Nolan     103   40000
2    NaN     105   50000

In [10]:
pd.merge(df1,df2,on = "emp_id", how = "outer")

     name  emp_id   salary
0     Bob     101  20000.0
1  Harley     102      NaN
2   Nolan     103  40000.0
3    Noah     104      NaN
4     NaN     105  50000.0

In [11]:
df1.set_index("emp_id").join(df2.set_index("emp_id"),how = "inner")

         name  salary
emp_id
101       Bob   20000
103     Nolan   40000

In [13]:
df1.set_index("emp_id",inplace = True)
df2.set_index("emp_id",inplace = True)

In [14]:
df1.join(df2,how = "inner")

         name  salary
emp_id
101       Bob   20000
103     Nolan   40000